In [1]:
import pandas as pd

In [4]:
# creer un objet Panda
obj = pd.Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
#recuperer les valeurs
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
#recuperer les index
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
#definir les index
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [14]:
#renvoyer un elt selon son index
obj2['a']

-5

In [15]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [1]:
""" Operations random sur les objets pandas"""

' Operations random sur les objets pandas'

In [17]:
#valeurs positives
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [18]:
# multiplication avec un entier
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [19]:
import numpy as np
#opérations avec numpy

In [21]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [27]:
#verifier si un index existe dans une series
'b' in obj2

True

In [24]:
'e' in obj2

False

In [28]:
#Convertir un "Dict" en "Series"
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [29]:
obj3 = pd.Series(sdata)

In [30]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [31]:
# Override les index d'une Series
states = ['California','Ohio','Oregon','Texas']

In [32]:
obj4 = pd.Series(sdata,index=states)

In [33]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [34]:
# detecter les données manquantes
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [35]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [37]:
# Somme de 2 Series : Les index se confondent et les valeurs correspondantes s'ajoutent
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [38]:
# Les attributs 'name' pour les index et values
obj4.name = 'population'

In [41]:
obj4.index.name ='State'

In [42]:
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [43]:
#Modifier les index
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [44]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [45]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [46]:
""" DATAFRAME """

' DATAFRAME '

In [48]:
#Creer un DataFrame
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop' :[1.5,1.7,3.6,2.4,2.9,3.2]}

In [49]:
frame = pd.DataFrame(data)

In [50]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [51]:
#réordonner les colonnes
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [52]:
#Ajouter une colonne sans données
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],
                      index=['one','two','three','four','five','six'])

In [53]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [54]:
#recuperer les colonnes
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [55]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [56]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [57]:
#Retourner une ligne sous forme de Series
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [58]:
# Modifier une colonne par affectation
frame2['debt'] = 16.5

In [59]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [60]:
frame2['debt'] = np.arange(6.)

In [62]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [63]:
#integrer des données depuis une Series vers un DataFrame
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [64]:
frame2['debt'] = val

In [65]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [66]:
#Ajouter une Colonne de Boolean avec True si 'state' == ohio
frame2['eastern'] = frame2.state == 'Ohio'

In [67]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [69]:
#Supprimer la colonne
del frame2['eastern']

In [70]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [71]:
#integrer un dict imbriqué
pop = {'Nevada' :{2001:2.4,2002:2.9},
       'Ohio' : {2000:1.5,2001:1.7,2002:3.6}}

In [72]:
frame3 = pd.DataFrame(pop)

In [73]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [74]:
#Transposer un DF
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [75]:
#Dict de Series en DataFrame
pdata = {'Ohio':frame3['Ohio'][:-1],
         'Nevada':frame3['Nevada'][:2]}

In [76]:
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [77]:
# 'name' attributes d'un dataFrame
frame3.index.name = 'year';frame3.columns.name  ='state'

In [78]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [79]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])